UBIEEE/FrankenMouse/firmware/platform/mouse_v2/STM32_WPAN/App/custom_app.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file    App/custom_app.c
  * @author  MCD Application Team
  * @brief   Custom Example Application (Server)
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "app_common.h"
#include "dbg_trace.h"
#include "ble.h"
#include "custom_app.h"
#include "custom_stm.h"
#include "stm32_seq.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

#include <micromouse/robot.h>
#include <stdbool.h>

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
typedef struct
{
  /* mainService */
  uint8_t               Main_task_char_Notification_Status;
  uint8_t               Main_error_char_Notification_Status;
  uint8_t               Main_song_char_Notification_Status;
  uint8_t               Main_status_char_Notification_Status;
  /* visionService */
  uint8_t               Vision_rawreadings_char_Notification_Status;
  uint8_t               Vision_distances_char_Notification_Status;
  /* driveService */
  uint8_t               Drive_data_char_Notification_Status;
  uint8_t               Drive_imudata_char_Notification_Status;
  uint8_t               Drive_pid_char_Notification_Status;
  uint8_t               Drive_chassisspeeds_char_Notification_Status;
  /* mazeService */
  uint8_t               Maze_cell_char_Notification_Status;
  uint8_t               Maze_mousepos_char_Notification_Status;
  /* USER CODE BEGIN CUSTOM_APP_Context_t */

  /* USER CODE END CUSTOM_APP_Context_t */

  uint16_t              ConnectionHandle;
} Custom_App_Context_t;

/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private defines ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macros -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
/**
 * START of Section BLE_APP_CONTEXT
 */

static Custom_App_Context_t Custom_App_Context;

/**
 * END of Section BLE_APP_CONTEXT
 */

uint8_t UpdateCharData[247];
uint8_t NotifyCharData[247];

/* USER CODE BEGIN PV */

bool g_robot_tasks_registered = false;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
/* mainService */
static void Custom_Main_task_char_Update_Char(void);
static void Custom_Main_task_char_Send_Notification(void);
static void Custom_Main_error_char_Update_Char(void);
static void Custom_Main_error_char_Send_Notification(void);
static void Custom_Main_song_char_Update_Char(void);
static void Custom_Main_song_char_Send_Notification(void);
static void Custom_Main_status_char_Update_Char(void);
static void Custom_Main_status_char_Send_Notification(void);
/* visionService */
static void Custom_Vision_rawreadings_char_Update_Char(void);
static void Custom_Vision_rawreadings_char_Send_Notification(void);
static void Custom_Vision_distances_char_Update_Char(void);
static void Custom_Vision_distances_char_Send_Notification(void);
/* driveService */
static void Custom_Drive_data_char_Update_Char(void);
static void Custom_Drive_data_char_Send_Notification(void);
static void Custom_Drive_imudata_char_Update_Char(void);
static void Custom_Drive_imudata_char_Send_Notification(void);
static void Custom_Drive_pid_char_Update_Char(void);
static void Custom_Drive_pid_char_Send_Notification(void);
static void Custom_Drive_chassisspeeds_char_Update_Char(void);
static void Custom_Drive_chassisspeeds_char_Send_Notification(void);
/* mazeService */
static void Custom_Maze_cell_char_Update_Char(void);
static void Custom_Maze_cell_char_Send_Notification(void);
static void Custom_Maze_mousepos_char_Update_Char(void);
static void Custom_Maze_mousepos_char_Send_Notification(void);

/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Functions Definition ------------------------------------------------------*/
void Custom_STM_App_Notification(Custom_STM_App_Notification_evt_t *pNotification)
{
  /* USER CODE BEGIN CUSTOM_STM_App_Notification_1 */

  /* USER CODE END CUSTOM_STM_App_Notification_1 */
  switch (pNotification->Custom_Evt_Opcode)
  {
    /* USER CODE BEGIN CUSTOM_STM_App_Notification_Custom_Evt_Opcode */

    /* USER CODE END CUSTOM_STM_App_Notification_Custom_Evt_Opcode */

    /* mainService */
    case CUSTOM_STM_MAIN_TASK_CHAR_WRITE_EVT:
      /* USER CODE BEGIN CUSTOM_STM_MAIN_TASK_CHAR_WRITE_EVT */

      /* USER CODE END CUSTOM_STM_MAIN_TASK_CHAR_WRITE_EVT */
      break;

    case CUSTOM_STM_MAIN_TASK_CHAR_NOTIFY_ENABLED_EVT:
      /* USER CODE BEGIN CUSTOM_STM_MAIN_TASK_CHAR_NOTIFY_ENABLED_EVT */

      /* USER CODE END CUSTOM_STM_MAIN_TASK_CHAR_NOTIFY_ENABLED_EVT */
      break;

    case CUSTOM_STM_MAIN_TASK_CHAR_NOTIFY_DISABLED_EVT:
      /* USER CODE BEGIN CUSTOM_STM_MAIN_TASK_CHAR_NOTIFY_DISABLED_EVT */

      /* USER CODE END CUSTOM_STM_MAIN_TASK_CHAR_NOTIFY_DISABLED_EVT */
      break;

    case CUSTOM_STM_MAIN_COMMAND_CHAR_WRITE_EVT:
      /* USER CODE BEGIN CUSTOM_STM_MAIN_COMMAND_CHAR_WRITE_EVT */

      /* USER CODE END CUSTOM_STM_MAIN_COMMAND_CHAR_WRITE_EVT */
      break;

    case CUSTOM_STM_MAIN_ERROR_CHAR_NOTIFY_ENABLED_EVT:
      /* USER CODE BEGIN CUSTOM_STM_MAIN_ERROR_CHAR_NOTIFY_ENABLED_EVT */

      /* USER CODE END CUSTOM_STM_MAIN_ERROR_CHAR_NOTIFY_ENABLED_EVT */
      break;

    case CUSTOM_STM_MAIN_ERROR_CHAR_NOTIFY_DISABLED_EVT:
      /* USER CODE BEGIN CUSTOM_STM_MAIN_ERROR_CHAR_NOTIFY_DISABLED_EVT */

      /* USER CODE END CUSTOM_STM_MAIN_ERROR_CHAR_NOTIFY_DISABLED_EVT */
      break;

    case CUSTOM_STM_MAIN_SONG_CHAR_WRITE_EVT:
      /* USER CODE BEGIN CUSTOM_STM_MAIN_SONG_CHAR_WRITE_EVT */

      /* USER CODE END CUSTOM_STM_MAIN_SONG_CHAR_WRITE_EVT */
      break;

    case CUSTOM_STM_MAIN_SONG_CHAR_NOTIFY_ENABLED_EVT:
      /* USER CODE BEGIN CUSTOM_STM_MAIN_SONG_CHAR_NOTIFY_ENABLED_EVT */

      /* USER CODE END CUSTOM_STM_MAIN_SONG_CHAR_NOTIFY_ENABLED_EVT */
      break;

    case CUSTOM_STM_MAIN_SONG_CHAR_NOTIFY_DISABLED_EVT:
      /* USER CODE BEGIN CUSTOM_STM_MAIN_SONG_CHAR_NOTIFY_DISABLED_EVT */

