UBIEEE/FrankenMouse/firmware/platform/mouse_v2/STM32_WPAN/App/custom_app.c
      /* USER CODE END CUSTOM_STM_MAIN_SONG_CHAR_NOTIFY_DISABLED_EVT */
      break;

    case CUSTOM_STM_MAIN_STATUS_CHAR_NOTIFY_ENABLED_EVT:
      /* USER CODE BEGIN CUSTOM_STM_MAIN_STATUS_CHAR_NOTIFY_ENABLED_EVT */

      /* USER CODE END CUSTOM_STM_MAIN_STATUS_CHAR_NOTIFY_ENABLED_EVT */
      break;

    case CUSTOM_STM_MAIN_STATUS_CHAR_NOTIFY_DISABLED_EVT:
      /* USER CODE BEGIN CUSTOM_STM_MAIN_STATUS_CHAR_NOTIFY_DISABLED_EVT */

      /* USER CODE END CUSTOM_STM_MAIN_STATUS_CHAR_NOTIFY_DISABLED_EVT */
      break;

    /* visionService */
    case CUSTOM_STM_VISION_RAWREADINGS_CHAR_NOTIFY_ENABLED_EVT:
      /* USER CODE BEGIN CUSTOM_STM_VISION_RAWREADINGS_CHAR_NOTIFY_ENABLED_EVT */

      /* USER CODE END CUSTOM_STM_VISION_RAWREADINGS_CHAR_NOTIFY_ENABLED_EVT */
      break;

    case CUSTOM_STM_VISION_RAWREADINGS_CHAR_NOTIFY_DISABLED_EVT:
      /* USER CODE BEGIN CUSTOM_STM_VISION_RAWREADINGS_CHAR_NOTIFY_DISABLED_EVT */

      /* USER CODE END CUSTOM_STM_VISION_RAWREADINGS_CHAR_NOTIFY_DISABLED_EVT */
      break;

    case CUSTOM_STM_VISION_DISTANCES_CHAR_NOTIFY_ENABLED_EVT:
      /* USER CODE BEGIN CUSTOM_STM_VISION_DISTANCES_CHAR_NOTIFY_ENABLED_EVT */

      /* USER CODE END CUSTOM_STM_VISION_DISTANCES_CHAR_NOTIFY_ENABLED_EVT */
      break;

    case CUSTOM_STM_VISION_DISTANCES_CHAR_NOTIFY_DISABLED_EVT:
      /* USER CODE BEGIN CUSTOM_STM_VISION_DISTANCES_CHAR_NOTIFY_DISABLED_EVT */

      /* USER CODE END CUSTOM_STM_VISION_DISTANCES_CHAR_NOTIFY_DISABLED_EVT */
      break;

    /* driveService */
    case CUSTOM_STM_DRIVE_DATA_CHAR_NOTIFY_ENABLED_EVT:
      /* USER CODE BEGIN CUSTOM_STM_DRIVE_DATA_CHAR_NOTIFY_ENABLED_EVT */

      /* USER CODE END CUSTOM_STM_DRIVE_DATA_CHAR_NOTIFY_ENABLED_EVT */
      break;

    case CUSTOM_STM_DRIVE_DATA_CHAR_NOTIFY_DISABLED_EVT:
      /* USER CODE BEGIN CUSTOM_STM_DRIVE_DATA_CHAR_NOTIFY_DISABLED_EVT */

      /* USER CODE END CUSTOM_STM_DRIVE_DATA_CHAR_NOTIFY_DISABLED_EVT */
      break;

    case CUSTOM_STM_DRIVE_IMUDATA_CHAR_NOTIFY_ENABLED_EVT:
      /* USER CODE BEGIN CUSTOM_STM_DRIVE_IMUDATA_CHAR_NOTIFY_ENABLED_EVT */

      /* USER CODE END CUSTOM_STM_DRIVE_IMUDATA_CHAR_NOTIFY_ENABLED_EVT */
      break;

    case CUSTOM_STM_DRIVE_IMUDATA_CHAR_NOTIFY_DISABLED_EVT:
      /* USER CODE BEGIN CUSTOM_STM_DRIVE_IMUDATA_CHAR_NOTIFY_DISABLED_EVT */

      /* USER CODE END CUSTOM_STM_DRIVE_IMUDATA_CHAR_NOTIFY_DISABLED_EVT */
      break;

    case CUSTOM_STM_DRIVE_PID_CHAR_WRITE_EVT:
      /* USER CODE BEGIN CUSTOM_STM_DRIVE_PID_CHAR_WRITE_EVT */

      /* USER CODE END CUSTOM_STM_DRIVE_PID_CHAR_WRITE_EVT */
      break;

    case CUSTOM_STM_DRIVE_PID_CHAR_NOTIFY_ENABLED_EVT:
      /* USER CODE BEGIN CUSTOM_STM_DRIVE_PID_CHAR_NOTIFY_ENABLED_EVT */

      /* USER CODE END CUSTOM_STM_DRIVE_PID_CHAR_NOTIFY_ENABLED_EVT */
      break;

    case CUSTOM_STM_DRIVE_PID_CHAR_NOTIFY_DISABLED_EVT:
      /* USER CODE BEGIN CUSTOM_STM_DRIVE_PID_CHAR_NOTIFY_DISABLED_EVT */

      /* USER CODE END CUSTOM_STM_DRIVE_PID_CHAR_NOTIFY_DISABLED_EVT */
      break;

    case CUSTOM_STM_DRIVE_CHASSISSPEEDS_CHAR_WRITE_EVT:
      /* USER CODE BEGIN CUSTOM_STM_DRIVE_CHASSISSPEEDS_CHAR_WRITE_EVT */

      /* USER CODE END CUSTOM_STM_DRIVE_CHASSISSPEEDS_CHAR_WRITE_EVT */
      break;

    case CUSTOM_STM_DRIVE_CHASSISSPEEDS_CHAR_NOTIFY_ENABLED_EVT:
      /* USER CODE BEGIN CUSTOM_STM_DRIVE_CHASSISSPEEDS_CHAR_NOTIFY_ENABLED_EVT */

      /* USER CODE END CUSTOM_STM_DRIVE_CHASSISSPEEDS_CHAR_NOTIFY_ENABLED_EVT */
      break;

    case CUSTOM_STM_DRIVE_CHASSISSPEEDS_CHAR_NOTIFY_DISABLED_EVT:
      /* USER CODE BEGIN CUSTOM_STM_DRIVE_CHASSISSPEEDS_CHAR_NOTIFY_DISABLED_EVT */

      /* USER CODE END CUSTOM_STM_DRIVE_CHASSISSPEEDS_CHAR_NOTIFY_DISABLED_EVT */
      break;

    /* mazeService */
    case CUSTOM_STM_MAZE_CELL_CHAR_NOTIFY_ENABLED_EVT:
      /* USER CODE BEGIN CUSTOM_STM_MAZE_CELL_CHAR_NOTIFY_ENABLED_EVT */

      /* USER CODE END CUSTOM_STM_MAZE_CELL_CHAR_NOTIFY_ENABLED_EVT */
      break;

    case CUSTOM_STM_MAZE_CELL_CHAR_NOTIFY_DISABLED_EVT:
      /* USER CODE BEGIN CUSTOM_STM_MAZE_CELL_CHAR_NOTIFY_DISABLED_EVT */

      /* USER CODE END CUSTOM_STM_MAZE_CELL_CHAR_NOTIFY_DISABLED_EVT */
      break;

    case CUSTOM_STM_MAZE_MOUSEPOS_CHAR_NOTIFY_ENABLED_EVT:
      /* USER CODE BEGIN CUSTOM_STM_MAZE_MOUSEPOS_CHAR_NOTIFY_ENABLED_EVT */

      /* USER CODE END CUSTOM_STM_MAZE_MOUSEPOS_CHAR_NOTIFY_ENABLED_EVT */
      break;

    case CUSTOM_STM_MAZE_MOUSEPOS_CHAR_NOTIFY_DISABLED_EVT:
      /* USER CODE BEGIN CUSTOM_STM_MAZE_MOUSEPOS_CHAR_NOTIFY_DISABLED_EVT */

      /* USER CODE END CUSTOM_STM_MAZE_MOUSEPOS_CHAR_NOTIFY_DISABLED_EVT */
      break;

    case CUSTOM_STM_NOTIFICATION_COMPLETE_EVT:
      /* USER CODE BEGIN CUSTOM_STM_NOTIFICATION_COMPLETE_EVT */

      /* USER CODE END CUSTOM_STM_NOTIFICATION_COMPLETE_EVT */
      break;

    default:
      /* USER CODE BEGIN CUSTOM_STM_App_Notification_default */

      /* USER CODE END CUSTOM_STM_App_Notification_default */
      break;
  }
  /* USER CODE BEGIN CUSTOM_STM_App_Notification_2 */

  /* USER CODE END CUSTOM_STM_App_Notification_2 */
  return;
}

void Custom_APP_Notification(Custom_App_ConnHandle_Not_evt_t *pNotification)
{
  /* USER CODE BEGIN CUSTOM_APP_Notification_1 */

  /* USER CODE END CUSTOM_APP_Notification_1 */

  switch (pNotification->Custom_Evt_Opcode)
  {
    /* USER CODE BEGIN CUSTOM_APP_Notification_Custom_Evt_Opcode */

    /* USER CODE END P2PS_CUSTOM_Notification_Custom_Evt_Opcode */
    case CUSTOM_CONN_HANDLE_EVT :
      /* USER CODE BEGIN CUSTOM_CONN_HANDLE_EVT */
      
      Robot_OnConnect();
      
      /* USER CODE END CUSTOM_CONN_HANDLE_EVT */
      break;

    case CUSTOM_DISCON_HANDLE_EVT :
      /* USER CODE BEGIN CUSTOM_DISCON_HANDLE_EVT */

      Robot_OnDisconnect();

      /* USER CODE END CUSTOM_DISCON_HANDLE_EVT */
      break;

    default:
      /* USER CODE BEGIN CUSTOM_APP_Notification_default */

      /* USER CODE END CUSTOM_APP_Notification_default */
      break;
  }

  /* USER CODE BEGIN CUSTOM_APP_Notification_2 */

  /* USER CODE END CUSTOM_APP_Notification_2 */

  return;
}

void Custom_APP_Init(void)
{
  /* USER CODE BEGIN CUSTOM_APP_Init */

  //
  // Initialize robot stuff.
  //
  Robot_Init();

  //
  // Register the robot update task with the sequencer.
  // The task will be executed every 20ms (see SysTick_Handler in stm32wbxx_it.c).
  //
  UTIL_SEQ_RegTask(1 << CFG_TASK_ROBOT_PERIODIC_ID, 0, Robot_Periodic);

  //
  // Register the robot send feedback task with the sequencer.
  // The task will be executed every 200ms (see SysTick_Handler in stm32wbxx_it.c).
  //
  UTIL_SEQ_RegTask(1 << CFG_TASK_ROBOT_SEND_FEEDBACK_ID, 0, Robot_PublishPeriodicFeedback);

  //
  // The tasks have been registered with the sequencer, so signal that the task
  // is ready to be run.
  //
  g_robot_tasks_registered = true;

  /* USER CODE END CUSTOM_APP_Init */
  return;
}

/* USER CODE BEGIN FD */

/* USER CODE END FD */

