UBIEEE/FrankenMouse/firmware/platform/mouse_v2/STM32_WPAN/App/custom_app.c
/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/

/* mainService */
void Custom_Main_task_char_Update_Char(void) /* Property Read */
{
  uint8_t updateflag = 0;

  /* USER CODE BEGIN Main_task_char_UC_1*/

  /* USER CODE END Main_task_char_UC_1*/

  if (updateflag != 0)
  {
    Custom_STM_App_Update_Char(CUSTOM_STM_MAIN_TASK_CHAR, (uint8_t *)UpdateCharData);
  }

  /* USER CODE BEGIN Main_task_char_UC_Last*/

  /* USER CODE END Main_task_char_UC_Last*/
  return;
}

void Custom_Main_task_char_Send_Notification(void) /* Property Notification */
{
  uint8_t updateflag = 0;

  /* USER CODE BEGIN Main_task_char_NS_1*/

  /* USER CODE END Main_task_char_NS_1*/

  if (updateflag != 0)
  {
    Custom_STM_App_Update_Char(CUSTOM_STM_MAIN_TASK_CHAR, (uint8_t *)NotifyCharData);
  }

  /* USER CODE BEGIN Main_task_char_NS_Last*/

  /* USER CODE END Main_task_char_NS_Last*/

  return;
}

void Custom_Main_error_char_Update_Char(void) /* Property Read */
{
  uint8_t updateflag = 0;

  /* USER CODE BEGIN Main_error_char_UC_1*/

  /* USER CODE END Main_error_char_UC_1*/

  if (updateflag != 0)
  {
    Custom_STM_App_Update_Char(CUSTOM_STM_MAIN_ERROR_CHAR, (uint8_t *)UpdateCharData);
  }

  /* USER CODE BEGIN Main_error_char_UC_Last*/

  /* USER CODE END Main_error_char_UC_Last*/
  return;
}

void Custom_Main_error_char_Send_Notification(void) /* Property Notification */
{
  uint8_t updateflag = 0;

  /* USER CODE BEGIN Main_error_char_NS_1*/

  /* USER CODE END Main_error_char_NS_1*/

  if (updateflag != 0)
  {
    Custom_STM_App_Update_Char(CUSTOM_STM_MAIN_ERROR_CHAR, (uint8_t *)NotifyCharData);
  }

  /* USER CODE BEGIN Main_error_char_NS_Last*/

  /* USER CODE END Main_error_char_NS_Last*/

  return;
}

void Custom_Main_song_char_Update_Char(void) /* Property Read */
{
  uint8_t updateflag = 0;

  /* USER CODE BEGIN Main_song_char_UC_1*/

  /* USER CODE END Main_song_char_UC_1*/

  if (updateflag != 0)
  {
    Custom_STM_App_Update_Char(CUSTOM_STM_MAIN_SONG_CHAR, (uint8_t *)UpdateCharData);
  }

  /* USER CODE BEGIN Main_song_char_UC_Last*/

  /* USER CODE END Main_song_char_UC_Last*/
  return;
}

void Custom_Main_song_char_Send_Notification(void) /* Property Notification */
{
  uint8_t updateflag = 0;

  /* USER CODE BEGIN Main_song_char_NS_1*/

  /* USER CODE END Main_song_char_NS_1*/

  if (updateflag != 0)
  {
    Custom_STM_App_Update_Char(CUSTOM_STM_MAIN_SONG_CHAR, (uint8_t *)NotifyCharData);
  }

  /* USER CODE BEGIN Main_song_char_NS_Last*/

  /* USER CODE END Main_song_char_NS_Last*/

  return;
}

void Custom_Main_status_char_Update_Char(void) /* Property Read */
{
  uint8_t updateflag = 0;

  /* USER CODE BEGIN Main_status_char_UC_1*/

  /* USER CODE END Main_status_char_UC_1*/

  if (updateflag != 0)
  {
    Custom_STM_App_Update_Char(CUSTOM_STM_MAIN_STATUS_CHAR, (uint8_t *)UpdateCharData);
  }

  /* USER CODE BEGIN Main_status_char_UC_Last*/

  /* USER CODE END Main_status_char_UC_Last*/
  return;
}

void Custom_Main_status_char_Send_Notification(void) /* Property Notification */
{
  uint8_t updateflag = 0;

  /* USER CODE BEGIN Main_status_char_NS_1*/

  /* USER CODE END Main_status_char_NS_1*/

  if (updateflag != 0)
  {
    Custom_STM_App_Update_Char(CUSTOM_STM_MAIN_STATUS_CHAR, (uint8_t *)NotifyCharData);
  }

  /* USER CODE BEGIN Main_status_char_NS_Last*/

  /* USER CODE END Main_status_char_NS_Last*/

  return;
}

/* visionService */
void Custom_Vision_rawreadings_char_Update_Char(void) /* Property Read */
{
  uint8_t updateflag = 0;

  /* USER CODE BEGIN Vision_rawreadings_char_UC_1*/

  /* USER CODE END Vision_rawreadings_char_UC_1*/

  if (updateflag != 0)
  {
    Custom_STM_App_Update_Char(CUSTOM_STM_VISION_RAWREADINGS_CHAR, (uint8_t *)UpdateCharData);
  }

  /* USER CODE BEGIN Vision_rawreadings_char_UC_Last*/

  /* USER CODE END Vision_rawreadings_char_UC_Last*/
  return;
}

void Custom_Vision_rawreadings_char_Send_Notification(void) /* Property Notification */
{
  uint8_t updateflag = 0;

  /* USER CODE BEGIN Vision_rawreadings_char_NS_1*/

  /* USER CODE END Vision_rawreadings_char_NS_1*/

  if (updateflag != 0)
  {
    Custom_STM_App_Update_Char(CUSTOM_STM_VISION_RAWREADINGS_CHAR, (uint8_t *)NotifyCharData);
  }

  /* USER CODE BEGIN Vision_rawreadings_char_NS_Last*/

  /* USER CODE END Vision_rawreadings_char_NS_Last*/

  return;
}

void Custom_Vision_distances_char_Update_Char(void) /* Property Read */
{
  uint8_t updateflag = 0;

  /* USER CODE BEGIN Vision_distances_char_UC_1*/

  /* USER CODE END Vision_distances_char_UC_1*/

  if (updateflag != 0)
  {
    Custom_STM_App_Update_Char(CUSTOM_STM_VISION_DISTANCES_CHAR, (uint8_t *)UpdateCharData);
  }

  /* USER CODE BEGIN Vision_distances_char_UC_Last*/

  /* USER CODE END Vision_distances_char_UC_Last*/
  return;
}

void Custom_Vision_distances_char_Send_Notification(void) /* Property Notification */
{
  uint8_t updateflag = 0;

  /* USER CODE BEGIN Vision_distances_char_NS_1*/

  /* USER CODE END Vision_distances_char_NS_1*/

  if (updateflag != 0)
  {
    Custom_STM_App_Update_Char(CUSTOM_STM_VISION_DISTANCES_CHAR, (uint8_t *)NotifyCharData);
  }

  /* USER CODE BEGIN Vision_distances_char_NS_Last*/

  /* USER CODE END Vision_distances_char_NS_Last*/

  return;
}

/* driveService */
void Custom_Drive_data_char_Update_Char(void) /* Property Read */
{
  uint8_t updateflag = 0;

  /* USER CODE BEGIN Drive_data_char_UC_1*/

  /* USER CODE END Drive_data_char_UC_1*/

  if (updateflag != 0)
  {
    Custom_STM_App_Update_Char(CUSTOM_STM_DRIVE_DATA_CHAR, (uint8_t *)UpdateCharData);
  }

  /* USER CODE BEGIN Drive_data_char_UC_Last*/

  /* USER CODE END Drive_data_char_UC_Last*/
  return;
}

void Custom_Drive_data_char_Send_Notification(void) /* Property Notification */
{
  uint8_t updateflag = 0;

  /* USER CODE BEGIN Drive_data_char_NS_1*/

  /* USER CODE END Drive_data_char_NS_1*/

  if (updateflag != 0)
  {
    Custom_STM_App_Update_Char(CUSTOM_STM_DRIVE_DATA_CHAR, (uint8_t *)NotifyCharData);
  }

  /* USER CODE BEGIN Drive_data_char_NS_Last*/

  /* USER CODE END Drive_data_char_NS_Last*/

  return;
}

void Custom_Drive_imudata_char_Update_Char(void) /* Property Read */
{
  uint8_t updateflag = 0;

  /* USER CODE BEGIN Drive_imudata_char_UC_1*/

  /* USER CODE END Drive_imudata_char_UC_1*/

