UBIEEE/FrankenMouse/firmware/platform/mouse_v2/STM32_WPAN/App/custom_app.c
  if (updateflag != 0)
  {
    Custom_STM_App_Update_Char(CUSTOM_STM_DRIVE_IMUDATA_CHAR, (uint8_t *)UpdateCharData);
  }

  /* USER CODE BEGIN Drive_imudata_char_UC_Last*/

  /* USER CODE END Drive_imudata_char_UC_Last*/
  return;
}

void Custom_Drive_imudata_char_Send_Notification(void) /* Property Notification */
{
  uint8_t updateflag = 0;

  /* USER CODE BEGIN Drive_imudata_char_NS_1*/

  /* USER CODE END Drive_imudata_char_NS_1*/

  if (updateflag != 0)
  {
    Custom_STM_App_Update_Char(CUSTOM_STM_DRIVE_IMUDATA_CHAR, (uint8_t *)NotifyCharData);
  }

  /* USER CODE BEGIN Drive_imudata_char_NS_Last*/

  /* USER CODE END Drive_imudata_char_NS_Last*/

  return;
}

void Custom_Drive_pid_char_Update_Char(void) /* Property Read */
{
  uint8_t updateflag = 0;

  /* USER CODE BEGIN Drive_pid_char_UC_1*/

  /* USER CODE END Drive_pid_char_UC_1*/

  if (updateflag != 0)
  {
    Custom_STM_App_Update_Char(CUSTOM_STM_DRIVE_PID_CHAR, (uint8_t *)UpdateCharData);
  }

  /* USER CODE BEGIN Drive_pid_char_UC_Last*/

  /* USER CODE END Drive_pid_char_UC_Last*/
  return;
}

void Custom_Drive_pid_char_Send_Notification(void) /* Property Notification */
{
  uint8_t updateflag = 0;

  /* USER CODE BEGIN Drive_pid_char_NS_1*/

  /* USER CODE END Drive_pid_char_NS_1*/

  if (updateflag != 0)
  {
    Custom_STM_App_Update_Char(CUSTOM_STM_DRIVE_PID_CHAR, (uint8_t *)NotifyCharData);
  }

  /* USER CODE BEGIN Drive_pid_char_NS_Last*/

  /* USER CODE END Drive_pid_char_NS_Last*/

  return;
}

void Custom_Drive_chassisspeeds_char_Update_Char(void) /* Property Read */
{
  uint8_t updateflag = 0;

  /* USER CODE BEGIN Drive_chassisspeeds_char_UC_1*/

  /* USER CODE END Drive_chassisspeeds_char_UC_1*/

  if (updateflag != 0)
  {
    Custom_STM_App_Update_Char(CUSTOM_STM_DRIVE_CHASSISSPEEDS_CHAR, (uint8_t *)UpdateCharData);
  }

  /* USER CODE BEGIN Drive_chassisspeeds_char_UC_Last*/

  /* USER CODE END Drive_chassisspeeds_char_UC_Last*/
  return;
}

void Custom_Drive_chassisspeeds_char_Send_Notification(void) /* Property Notification */
{
  uint8_t updateflag = 0;

  /* USER CODE BEGIN Drive_chassisspeeds_char_NS_1*/

  /* USER CODE END Drive_chassisspeeds_char_NS_1*/

  if (updateflag != 0)
  {
    Custom_STM_App_Update_Char(CUSTOM_STM_DRIVE_CHASSISSPEEDS_CHAR, (uint8_t *)NotifyCharData);
  }

  /* USER CODE BEGIN Drive_chassisspeeds_char_NS_Last*/

  /* USER CODE END Drive_chassisspeeds_char_NS_Last*/

  return;
}

/* mazeService */
void Custom_Maze_cell_char_Update_Char(void) /* Property Read */
{
  uint8_t updateflag = 0;

  /* USER CODE BEGIN Maze_cell_char_UC_1*/

  /* USER CODE END Maze_cell_char_UC_1*/

  if (updateflag != 0)
  {
    Custom_STM_App_Update_Char(CUSTOM_STM_MAZE_CELL_CHAR, (uint8_t *)UpdateCharData);
  }

  /* USER CODE BEGIN Maze_cell_char_UC_Last*/

  /* USER CODE END Maze_cell_char_UC_Last*/
  return;
}

void Custom_Maze_cell_char_Send_Notification(void) /* Property Notification */
{
  uint8_t updateflag = 0;

  /* USER CODE BEGIN Maze_cell_char_NS_1*/

  /* USER CODE END Maze_cell_char_NS_1*/

  if (updateflag != 0)
  {
    Custom_STM_App_Update_Char(CUSTOM_STM_MAZE_CELL_CHAR, (uint8_t *)NotifyCharData);
  }

  /* USER CODE BEGIN Maze_cell_char_NS_Last*/

  /* USER CODE END Maze_cell_char_NS_Last*/

  return;
}

void Custom_Maze_mousepos_char_Update_Char(void) /* Property Read */
{
  uint8_t updateflag = 0;

  /* USER CODE BEGIN Maze_mousepos_char_UC_1*/

  /* USER CODE END Maze_mousepos_char_UC_1*/

  if (updateflag != 0)
  {
    Custom_STM_App_Update_Char(CUSTOM_STM_MAZE_MOUSEPOS_CHAR, (uint8_t *)UpdateCharData);
  }

  /* USER CODE BEGIN Maze_mousepos_char_UC_Last*/

  /* USER CODE END Maze_mousepos_char_UC_Last*/
  return;
}

void Custom_Maze_mousepos_char_Send_Notification(void) /* Property Notification */
{
  uint8_t updateflag = 0;

  /* USER CODE BEGIN Maze_mousepos_char_NS_1*/

  /* USER CODE END Maze_mousepos_char_NS_1*/

  if (updateflag != 0)
  {
    Custom_STM_App_Update_Char(CUSTOM_STM_MAZE_MOUSEPOS_CHAR, (uint8_t *)NotifyCharData);
  }

  /* USER CODE BEGIN Maze_mousepos_char_NS_Last*/

  /* USER CODE END Maze_mousepos_char_NS_Last*/

  return;
}

/* USER CODE BEGIN FD_LOCAL_FUNCTIONS*/

/* USER CODE END FD_LOCAL_FUNCTIONS*/
